In [1]:
import numpy as np
import pandas as pd

In [5]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Venessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [6]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Venessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [9]:
Comp = df.groupby('Company')
Comp

In [10]:
Comp.mean()

C:\Users\User\AppData\Local\Temp\ipykernel_11824\889823214.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [11]:
Comp.sum()

C:\Users\User\AppData\Local\Temp\ipykernel_11824\1863415123.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [12]:
Comp.sum().loc['FB']

C:\Users\User\AppData\Local\Temp\ipykernel_11824\3434742692.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [14]:
#code to run on a single line
df.groupby('Company').sum().loc['FB']

C:\Users\User\AppData\Local\Temp\ipykernel_11824\1330519564.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [15]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [18]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [19]:
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64